Revit 2026 API

# StructuralSectionGeneralU Methods

---

The StructuralSectionGeneralU type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from StructuralSection) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBoundarySize | Returns size of the section boundary. (Inherited from StructuralSection) |
|  | GetEnumerator | (Inherited from StructuralSection) |
|  | GetFlangeThicknessInFlangeCenter | Returns thickness of flange measured in the 0.5 * (width - webThickess), sometimes used for sections with width > 300 mm. |
|  | GetFlangeThicknessInWidthCenter | Returns thickness of flange measured in the 0.5 * width, sometimes used for sections with width <= 300 mm. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

StructuralSectionGeneralU Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace